; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation4 - direction
	Star8 - direction
	GroundStation9 - direction
	Star11 - direction
	GroundStation6 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Star7 - direction
	Star10 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Planet20 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(have_image Phenomenon12 thermograph0)
	(have_image Phenomenon13 thermograph0)
	(have_image Planet14 thermograph0)
	(have_image Planet15 thermograph0)
	(have_image Star16 thermograph0)
	(have_image Star17 thermograph0)
	(have_image Phenomenon18 thermograph0)
	(have_image Phenomenon19 thermograph0)
	(have_image Planet20 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
2. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 9
3. (turn_to satellite0 phenomenon18 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon18)
   goals met: 0 of 9
4. (take_image satellite0 phenomenon18 instrument1 thermograph0)
   added: (have_image phenomenon18 thermograph0)
   goals met: 1 of 9
5. (turn_to satellite0 phenomenon13 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 9
6. (take_image satellite0 phenomenon13 instrument1 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 2 of 9
7. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 9
8. (take_image satellite0 phenomenon12 instrument1 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 3 of 9
9. (turn_to satellite0 phenomenon19 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon19)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon19 instrument1 thermograph0)
   added: (have_image phenomenon19 thermograph0)
   goals met: 4 of 9
11. (turn_to satellite0 planet14 phenomenon19)
   deleted: (pointing satellite0 phenomenon19)
   added: (pointing satellite0 planet14)
   goals met: 4 of 9
12. (take_image satellite0 planet14 instrument1 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 5 of 9
13. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 5 of 9
14. (take_image satellite0 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 6 of 9
15. (turn_to satellite0 planet20 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet20)
   goals met: 6 of 9
16. (take_image satellite0 planet20 instrument1 image1)
   added: (have_image planet20 image1)
   goals met: 7 of 9
17. (turn_to satellite0 star16 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 star16)
   goals met: 7 of 9
18. (take_image satellite0 star16 instrument1 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 8 of 9
19. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 8 of 9
20. (take_image satellite0 star17 instrument1 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 9 of 9
